contextablemark/esp32-agui/agui-voice/components/chat_ui/chat_ui.c
// Screen-power state shared by the activity hook (below) and screen_power_task. Defined here so the
// LVGL event cb installed in chat_ui_init can stamp activity; the rest of the saver lives lower down.
static volatile uint32_t s_last_activity_ms;           // monotonic ms of last activity (touch/UI/PWR)
static inline uint32_t now_ms(void) { return (uint32_t)(esp_timer_get_time() / 1000); }

// LVGL event cb: any touch/scroll on the UI is "activity". Runs inside the LVGL task (lock already
// held by lv_timer_handler), so it just stamps the time — no lock, no I2C, no contention.
static void chat_ui_activity_evt_cb(lv_event_t *e)
{
    (void)e;
    s_last_activity_ms = now_ms();
}

static void chat_ui_talk_evt_cb(lv_event_t *e);   // touch-to-talk; defined with the screen-power code below

esp_err_t chat_ui_init(void)
{
    if (!bsp_display_start()) { ESP_LOGE(TAG, "bsp_display_start failed"); return ESP_FAIL; }
    if (!bsp_display_lock(3000)) { ESP_LOGE(TAG, "display lock timed out"); return ESP_FAIL; }
    lv_obj_t *scr = lv_scr_act();
    lv_obj_set_style_bg_color(scr, lv_color_hex(COL_BG), 0);
    lv_obj_set_style_bg_opa(scr, LV_OPA_COVER, 0);
    lv_obj_clear_flag(scr, LV_OBJ_FLAG_SCROLLABLE);

    // Status line: a fixed-width clipping box holding a single-line label. Long live transcripts
    // scroll left so the tail (latest words) stays on screen; short messages center. (clips to the
    // box edges, respecting the round-corner safe zone — not the screen edge.)
    lv_obj_t *box = lv_obj_create(scr);
    lv_obj_remove_style_all(box);
    lv_obj_set_size(box, CHAT_W, STATUS_H);
    lv_obj_align(box, LV_ALIGN_TOP_MID, 0, SAFE_INSET);
    lv_obj_clear_flag(box, LV_OBJ_FLAG_SCROLLABLE);

    s_status = lv_label_create(box);
    lv_label_set_long_mode(s_status, LV_LABEL_LONG_CLIP);   // one line, full content width, no dots
    lv_obj_set_style_text_color(s_status, lv_palette_main(LV_PALETTE_GREY), 0);
    lv_obj_set_style_text_font(s_status, CHAT_FONT, 0);
    lv_obj_set_pos(s_status, 0, 7);
    lv_label_set_text(s_status, "Connecting...");   // not ready until WiFi is up + boot sets IDLE_HINT

    s_chat = lv_obj_create(scr);
    lv_obj_remove_style_all(s_chat);
    lv_obj_set_size(s_chat, BSP_LCD_H_RES - 2 * SAFE_INSET,
                    BSP_LCD_V_RES - 2 * SAFE_INSET - STATUS_H);
    lv_obj_align(s_chat, LV_ALIGN_TOP_MID, 0, SAFE_INSET + STATUS_H);
    lv_obj_set_flex_flow(s_chat, LV_FLEX_FLOW_COLUMN);
    lv_obj_set_style_pad_row(s_chat, 8, 0);
    lv_obj_add_flag(s_chat, LV_OBJ_FLAG_SCROLLABLE);   // remove_style_all leaves flags, but be explicit
    lv_obj_set_scroll_dir(s_chat, LV_DIR_VER);
    lv_obj_set_scrollbar_mode(s_chat, LV_SCROLLBAR_MODE_OFF);

    // Touch/scroll = activity for the screen-power saver. This event cb runs INSIDE the LVGL task
    // (already holding lvgl_mutex), so it bumps s_last_activity_ms without ever taking a lock — i.e.
    // it works even when screen_power_task can't grab the lock to read lv_disp_get_inactive_time().
    // Cover the chat list (scroll) and the screen (raw press/release) so reading/flinging keeps the
    // panel awake. LV_EVENT_PRESSING/SCROLL fire continuously, so the screen never blanks mid-gesture.
    lv_obj_add_event_cb(s_chat, chat_ui_activity_evt_cb, LV_EVENT_SCROLL, NULL);
    lv_obj_add_event_cb(s_chat, chat_ui_activity_evt_cb, LV_EVENT_PRESSING, NULL);
    lv_obj_add_event_cb(scr,    chat_ui_activity_evt_cb, LV_EVENT_PRESSING, NULL);
    lv_obj_add_event_cb(scr,    chat_ui_activity_evt_cb, LV_EVENT_RELEASED, NULL);

    // Touch-to-talk: long-press anywhere → start a turn, release → stop. Registered on BOTH the root
    // (presses over the blank/status area) AND the chat list (which covers most of the screen — a press
    // there goes to s_chat and does NOT bubble to scr). A drag on the chat still scrolls, because LVGL
    // suppresses LONG_PRESSED once a scroll begins; a still hold fires it.
    lv_obj_add_event_cb(scr,    chat_ui_talk_evt_cb, LV_EVENT_LONG_PRESSED, NULL);
    lv_obj_add_event_cb(scr,    chat_ui_talk_evt_cb, LV_EVENT_RELEASED,     NULL);
    lv_obj_add_event_cb(s_chat, chat_ui_talk_evt_cb, LV_EVENT_LONG_PRESSED, NULL);
    lv_obj_add_event_cb(s_chat, chat_ui_talk_evt_cb, LV_EVENT_RELEASED,     NULL);

    // Raise the touch scroll threshold so a STILL hold (with the few px of capacitive jitter) over the
    // scrollable chat isn't read as a scroll — which would cancel the long-press. A deliberate drag
    // (> this many px) still scrolls. Default is 10; 30 reliably distinguishes hold-to-talk from scroll.
    lv_indev_t *indev = lv_indev_get_next(NULL);
    if (indev && indev->driver) indev->driver->scroll_limit = 30;

    bsp_display_unlock();
    bsp_display_brightness_set(SCREEN_ON_BRIGHTNESS);
    ESP_LOGI(TAG, "chat UI up (%dx%d, LVGL 8.4)", BSP_LCD_H_RES, BSP_LCD_V_RES);
    return ESP_OK;
}

void chat_ui_add_user(const char *text)
{
    chat_ui_note_activity();
    if (!s_chat || !bsp_display_lock(1000)) return;
    add_bubble(true, COL_USER, text);
    scroll_bottom();
    bsp_display_unlock();
}

void *chat_ui_begin_assistant(void)
{
    chat_ui_note_activity();
    if (!s_chat || !bsp_display_lock(1000)) return NULL;
    s_assist_buf[0] = '\0'; s_assist_len = 0;
    s_assist_lbl = add_bubble(false, COL_ASSIST, "");
    scroll_bottom();
    bsp_display_unlock();
    return s_assist_lbl;
}

void chat_ui_append_assistant(const char *delta)
{
    chat_ui_note_activity();
    if (!s_assist_lbl || !delta || !bsp_display_lock(1000)) return;

    // Consume the whole delta byte-by-byte, spilling into a fresh assistant bubble whenever the
    // current one hits ASSIST_BUBBLE_MAX_CHARS. This (a) never silently drops text the way the old
    // fixed-buffer cap did, and (b) keeps every label short → cheap to re-measure/redraw and the
    // flex-column height stays well under the lv_coord_t ceiling. We break at a space near the cap
    // so words aren't split mid-token; if there's no recent space we hard-break.
    for (size_t i = 0; delta[i]; ) {
        // If the current bubble is full, finalize it and open a new one (continuation).
        if (s_assist_len >= ASSIST_BUBBLE_MAX_CHARS) {
            // Prefer to break at the last space so the new bubble starts on a word boundary.
            size_t br = s_assist_len;
            while (br > ASSIST_BUBBLE_MAX_CHARS - 80 && br > 0 && s_assist_buf[br - 1] != ' ') br--;
            char carry[80];
            size_t carry_len = 0;
            if (br > ASSIST_BUBBLE_MAX_CHARS - 80 && br < s_assist_len) {   // found a space: move tail
                carry_len = s_assist_len - br;
                memcpy(carry, s_assist_buf + br, carry_len);
                s_assist_buf[br] = '\0';
                apply_wrapped(s_assist_lbl, s_assist_buf);                  // re-render trimmed bubble
            }
            s_assist_lbl = add_bubble(false, COL_ASSIST, "");              // continuation bubble
            memcpy(s_assist_buf, carry, carry_len);
            s_assist_len = carry_len;
            s_assist_buf[s_assist_len] = '\0';
        }
        // Append as much of the remaining delta as fits before the per-bubble cap.
        size_t room = ASSIST_BUBBLE_MAX_CHARS - s_assist_len;
        size_t take = 0;
        while (take < room && delta[i + take]) take++;
        memcpy(s_assist_buf + s_assist_len, delta + i, take);
        s_assist_len += take;
        s_assist_buf[s_assist_len] = '\0';
        i += take;
        apply_wrapped(s_assist_lbl, s_assist_buf);
    }
    scroll_bottom();
    bsp_display_unlock();
}

void chat_ui_status(const char *text)
{
    chat_ui_note_activity();
    if (!s_status || !bsp_display_lock(1000)) return;
    char clean[1024];                              // live transcript can be long
    sanitize(text ? text : "", clean, sizeof clean);
    lv_label_set_text(s_status, clean);
    lv_obj_update_layout(s_status);                // measure full text width, then position:
    lv_coord_t lw = lv_obj_get_width(s_status), bw = CHAT_W;
    lv_obj_set_x(s_status, lw > bw ? (bw - lw)      // overflow → show the tail (scroll left)
                                   : (bw - lw) / 2); // fits → center
    bsp_display_unlock();
}

void chat_ui_clear_status(void) { chat_ui_status("Ready"); }

