contextablemark/esp32-agui/agui-voice/components/chat_ui/chat_ui.c
// --- screen-power saver (power mgmt; standalone, not in the numbered phase plan) --------------
// Blank the AMOLED (brightness 0 ≈ near-zero panel draw on OLED) after a span with no activity,
// and wake on any input. Activity = touch (LVGL tracks it per input device), the PWR key (AXP2101
// PWRKEY, polled via device_tools), or any UI mutation (the chat_ui_* setters call note_activity,
// which covers PTT turns + streaming replies). A separate low-priority task polls so the I2C PWR-key
// read never runs under the LVGL lock. This is distinct from chat_ui_idle_timer (the set_timer
// countdown shown on the idle screen), below.
static uint32_t          s_idle_timeout_ms = SCREEN_IDLE_TIMEOUT_MS;
static bool              s_idle_disabled;               // "always on": never blank (configured timeout 0)
static bool              s_screen_on = true;
static bool              s_force_off_armed;             // PWR-tapped off; stays off until newer activity
static uint32_t          s_force_off_ms;                // when the force-off press happened
static volatile bool     s_alarm_active;                // a timer is ringing → it owns the screen
static lv_obj_t         *s_alarm_overlay;               // full-screen black overlay shown while ringing
static lv_obj_t         *s_alarm_ring;                  // default graphic: red ring (toggled to flash)
static lv_obj_t         *s_alarm_img;                   // user graphic (if uploaded): pulsed via img_opa
static lv_img_dsc_t      s_alarm_img_dsc;               // descriptor over s_alarm_img_buf (must persist)
static uint8_t          *s_alarm_img_buf;               // RGB565 pixels in PSRAM (freed on alarm off)

void chat_ui_note_activity(void) { s_last_activity_ms = now_ms(); }

// Enter/leave alarm mode. On: cover the UI with a black overlay holding a big red ring (outline) in
// the center, and suspend the idle power-saver so the timer task can flash the panel in time with the
// beeps. Off: remove the overlay and resume the saver (screen left on). LVGL ops → this locks; called
// from the timer task, never a handler.
void chat_ui_alarm_set(bool on)
{
    if (on) {
        if (bsp_display_lock(1000)) {
            if (!s_alarm_overlay) {
                s_alarm_overlay = lv_obj_create(lv_scr_act());
                lv_obj_remove_style_all(s_alarm_overlay);
                lv_obj_set_size(s_alarm_overlay, lv_pct(100), lv_pct(100));
                lv_obj_set_style_bg_color(s_alarm_overlay, lv_color_black(), 0);
                lv_obj_set_style_bg_opa(s_alarm_overlay, LV_OPA_COVER, 0);
                lv_obj_clear_flag(s_alarm_overlay, LV_OBJ_FLAG_SCROLLABLE);

                // A user-uploaded graphic (flash) wins; otherwise the built-in red ring. The image is
                // RGB565 in PSRAM, shown centered on black and pulsed via img_opa with the beeps.
                if (alarm_img_present() && alarm_img_load(&s_alarm_img_buf) == ESP_OK) {
                    s_alarm_img_dsc.header.always_zero = 0;
                    s_alarm_img_dsc.header.cf = LV_IMG_CF_TRUE_COLOR;
                    s_alarm_img_dsc.header.w  = ALARM_IMG_W;
                    s_alarm_img_dsc.header.h  = ALARM_IMG_H;
                    s_alarm_img_dsc.data_size = ALARM_IMG_BYTES;
                    s_alarm_img_dsc.data      = s_alarm_img_buf;
                    lv_obj_t *img = lv_img_create(s_alarm_overlay);
                    lv_img_set_src(img, &s_alarm_img_dsc);
                    lv_obj_center(img);
                    lv_obj_clear_flag(img, LV_OBJ_FLAG_SCROLLABLE);
                    lv_obj_set_style_img_opa(img, LV_OPA_30, 0);     // start dimmed; flash pulses it bright
                    s_alarm_img = img;
                } else {
                    lv_obj_t *ring = lv_obj_create(s_alarm_overlay); // outline-only circle (no fill)
                    lv_obj_remove_style_all(ring);
                    lv_obj_set_size(ring, 220, 220);
                    lv_obj_set_style_radius(ring, LV_RADIUS_CIRCLE, 0);
                    lv_obj_set_style_bg_opa(ring, LV_OPA_TRANSP, 0);
                    lv_obj_set_style_border_color(ring, lv_color_hex(0xFF2222), 0);
                    lv_obj_set_style_border_width(ring, 14, 0);
                    lv_obj_center(ring);
                    lv_obj_clear_flag(ring, LV_OBJ_FLAG_SCROLLABLE);
                    lv_obj_add_flag(ring, LV_OBJ_FLAG_HIDDEN);       // start dark; flash reveals it
                    s_alarm_ring = ring;
                }
            }
            bsp_display_unlock();
        }
        s_alarm_active = true;
        // Steady brightness for the whole alarm: flash by toggling the RING (in the LVGL task), NOT by
        // toggling the panel — rapid brightness commands (0x51) share the QSPI io handle with LVGL's
        // flush and get dropped under contention (the panel just stays dark). Set it once here.
        bsp_display_brightness_set(SCREEN_ON_BRIGHTNESS);
    } else {
        s_alarm_active = false;
        if (bsp_display_lock(1000)) {
            if (s_alarm_overlay) {                         // deletes children (ring/img) too
                lv_obj_del(s_alarm_overlay);
                s_alarm_overlay = NULL; s_alarm_ring = NULL; s_alarm_img = NULL;
            }
            if (s_alarm_img_buf) { alarm_img_free(s_alarm_img_buf); s_alarm_img_buf = NULL; }  // after del → no live draw
            bsp_display_unlock();
        }
        s_screen_on = true;             // alarm ended: screen is on, resync the saver
        s_force_off_armed = false;
        chat_ui_note_activity();
    }
}

// Flash the alarm ring on/off in time with the beeps by toggling its HIDDEN flag (the panel stays at
// a steady brightness). Cheap: a flag flip + small invalidate under a short lock — the LVGL task does
// the partial redraw on its next cycle, so this never blocks the caller and never fights LVGL's flush
// for a full-screen brightness toggle. No-op if the alarm overlay isn't up. Called from the timer task.
void chat_ui_alarm_flash(bool on)
{
    if (!s_alarm_ring && !s_alarm_img) return;
    if (bsp_display_lock(80)) {
        if (s_alarm_img) {                           // user graphic: pulse opacity (never fully dark)
            lv_obj_set_style_img_opa(s_alarm_img, on ? LV_OPA_COVER : LV_OPA_30, 0);
            lv_obj_invalidate(s_alarm_img);
        } else if (s_alarm_ring) {                   // default ring: hard flash (re-check under lock)
            if (on) lv_obj_clear_flag(s_alarm_ring, LV_OBJ_FLAG_HIDDEN);
            else    lv_obj_add_flag(s_alarm_ring, LV_OBJ_FLAG_HIDDEN);
            lv_obj_invalidate(s_alarm_ring);         // mark its 220x220 area dirty for the next flush
        }
        bsp_display_unlock();
    }
}

uint32_t chat_ui_touch_idle_ms(void)
{
    uint32_t ti = UINT32_MAX;
    if (bsp_display_lock(50)) { ti = lv_disp_get_inactive_time(NULL); bsp_display_unlock(); }
    return ti;
}

