contextablemark/esp32-agui/agui-voice/components/chat_ui/chat_ui.c
// Power-state hook (gates light sleep on display on/off); notified from screen_power_task.
static chat_ui_power_cb s_power_cb;
void chat_ui_set_power_cb(chat_ui_power_cb cb) { s_power_cb = cb; }

// Touch-to-talk: long-press the screen → cb(1) (start), release → cb(0) (stop). s_talk_armed gates the
// release so a quick tap (no preceding long-press) doesn't fire a spurious stop. Runs in the LVGL task
// with the display lock already held, so it only flips flags + calls the (non-blocking) app callback.
static chat_ui_talk_cb s_talk_cb;
static void           *s_talk_ctx;
static bool            s_talk_armed;
void chat_ui_set_talk_cb(chat_ui_talk_cb cb, void *ctx) { s_talk_cb = cb; s_talk_ctx = ctx; }

static void chat_ui_talk_evt_cb(lv_event_t *e)
{
    if (s_alarm_active) return;                       // a ringing timer owns the screen (tap-to-dismiss)
    lv_event_code_t code = lv_event_get_code(e);
    if (code == LV_EVENT_LONG_PRESSED) {
        if (s_talk_armed) return;                    // already armed (e.g. both scr + s_chat fired) → once
        ESP_LOGI(TAG, "touch-to-talk: hold");
        s_talk_armed = true;
        if (s_talk_cb) s_talk_cb(1, s_talk_ctx);     // hold start → like a BOOT down
    } else if (code == LV_EVENT_RELEASED) {
        if (s_talk_armed && s_talk_cb) s_talk_cb(0, s_talk_ctx);   // release → stop + run
        s_talk_armed = false;
    }
}

// PWR (AXP2101 PWRKEY) short-press hook (used for volume down). Polled by screen_power_task.
static chat_ui_pwrkey_cb s_pwrkey_cb;
void chat_ui_set_pwrkey_cb(chat_ui_pwrkey_cb cb) { s_pwrkey_cb = cb; }

static void screen_power_task(void *arg)
{
    chat_ui_note_activity();
    for (;;) {
        vTaskDelay(pdMS_TO_TICKS(SCREEN_POLL_MS));

        // PWR (AXP2101 PWRKEY) short press → volume down (repurposed from the old screen toggle). It
        // also wakes the display, like any other input. A long PWR hold still powers the device off
        // (AXP2101 hardware). The screen now only blanks via the idle timeout (auto-off).
        bool pwr = device_power_key_short_press();   // always consume so the latch can't fire post-alarm
        if (s_alarm_active) continue;                // a ringing timer owns the screen (brightness flash +
                                                     // tap-to-dismiss run in timer_alert_task); skip idle/PWR
        if (pwr) {
            chat_ui_note_activity();                 // PWR press wakes the screen
            if (s_pwrkey_cb) s_pwrkey_cb();          // → volume down
        }

        // "Always on" (configured timeout = 0): never blank. Keep the panel lit (re-light it if it
        // had been off before the setting changed) and skip all idle accounting below.
        if (s_idle_disabled) {
            if (!s_screen_on) {
                s_screen_on = true;
                bsp_display_brightness_set(SCREEN_ON_BRIGHTNESS);
                if (s_power_cb) s_power_cb(true);
            }
            continue;
        }

        // Idle accounting is now driven entirely by s_last_activity_ms, which is stamped by every UI
        // mutation, PTT/PWR press, AND every touch/scroll event (chat_ui_activity_evt_cb, installed in
        // chat_ui_init). So we no longer read lv_disp_get_inactive_time under the LVGL lock — that read
        // was the sole reason this task contended bsp_display_lock(50) every 200ms, and it timed out
        // (flooding "Failed to acquire LVGL lock") exactly when the LVGL task was busy rendering a long
        // reply / heavy scroll. A busy LVGL task means the user is interacting: the opposite of idle, so
        // there is nothing to gain by reading it. Keep one cheap, non-contending peek with a generous
        // timeout purely as a backstop, and on failure treat BUSY as activity (do not blank).
        uint32_t now = now_ms();
        if (!s_screen_on || (now - s_last_activity_ms) >= (s_idle_timeout_ms - SCREEN_POLL_MS)) {
            // Only near the blank threshold (or while already off) do we briefly try the lock, with a
            // long timeout so it rarely fails; success refreshes touch idle, failure = LVGL busy = active.
            if (bsp_display_lock(200)) {
                uint32_t ti = lv_disp_get_inactive_time(NULL);
                bsp_display_unlock();
                if (ti < (now - s_last_activity_ms)) s_last_activity_ms = now - ti;   // touch is newer
            } else {
                s_last_activity_ms = now;   // LVGL busy → treat as activity, never blank mid-render
            }
        }
        uint32_t act_age = now - s_last_activity_ms;                  // ms since last activity of any kind
        uint32_t idle = act_age;

        if (s_force_off_armed && idle < (now - s_force_off_ms))
            s_force_off_armed = false;                               // activity after the press → unarm

        bool want_on = s_force_off_armed ? false : (idle < s_idle_timeout_ms);
        if (want_on != s_screen_on) {
            s_screen_on = want_on;
            bsp_display_brightness_set(want_on ? SCREEN_ON_BRIGHTNESS : 0);
            ESP_LOGI(TAG, "screen %s (idle=%ums%s)", want_on ? "on" : "off",
                     (unsigned)idle, want_on ? "" : (s_force_off_armed ? ", PWR-off" : ""));
            if (s_power_cb) s_power_cb(want_on);   // gate light sleep on display state
        }
    }
}

void chat_ui_set_screen_timeout_s(int seconds)
{
    if (seconds <= 0) {                                // 0 = always on (never blank)
        s_idle_disabled = true;
    } else {
        s_idle_disabled = false;
        s_idle_timeout_ms = (uint32_t)seconds * 1000;
    }
}

void chat_ui_screen_power_start(int idle_timeout_s)
{
    chat_ui_set_screen_timeout_s(idle_timeout_s);      // 0 = always on; >0 = blank after N seconds
    chat_ui_note_activity();
    s_screen_on = true;
    s_force_off_armed = false;
    xTaskCreate(screen_power_task, "scrnpwr", 4096, NULL, 3, NULL);
    if (s_idle_disabled)
        ESP_LOGI(TAG, "screen-power saver: always on (no auto-blank)");
    else
        ESP_LOGI(TAG, "screen-power saver: blank after %us idle (wake on touch / PWR key / activity)",
                 (unsigned)(s_idle_timeout_ms / 1000));
}

// --- later phases ---
void chat_ui_show_qr(const char *data)            { (void)data; }          // P6
void chat_ui_idle_timer(int s, const char *label) { (void)s; (void)label; } // P7: set_timer countdown

void chat_ui_prompt(const char *message, const cJSON *response_schema,
                    int64_t expires_at, chat_ui_answer_cb cb, void *ctx)
{
    (void)message; (void)response_schema; (void)expires_at; (void)cb; (void)ctx;
    ESP_LOGW(TAG, "chat_ui_prompt not implemented yet");   // P6
}
